app/controllers/exports_controller.rb

	def index
		DriverManager.registerDriver Java::oracle.jdbc.driver.OracleDriver.new
		plsql.connection = DriverManager.getConnection()

	  	#export code is courtesy of Scott Becker: http://synthesis.sbecker.net/articles/2007/06/07/how-to-generate-csv-files-in-rails
	  	@rsvps = Rsvp.all
---
SELECT * FROM `rsvps`