app/controllers/rsvps_controller.rb

SELECT * FROM `rsvps` WHERE (`rsvps`.`id` = 1)
---
  def show
    @rsvp = Rsvp.find(params[:id])

SELECT * FROM `users` WHERE (username = 'spoutlkjlkjldkjlkjsmeimimsdfasdjji')
SELECT count(*) AS count_all FROM `users` WHERE (username = 'spoutlkjlkjldkjlkjsmeimimsdfasdjji')
SELECT * FROM `roles` WHERE (name = 'Student') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `users` (`username`, `display_name`, `role_id`, `created_at`, `updated_at`) VALUES('abrown12', NULL, NULL, '2010-09-01 03:00:34', '2010-09-01 03:00:34')
SELECT * FROM `rsvps` WHERE (user_id = 1) LIMIT 1
---
  def new
    #check that user doesn't exist, then create them

  	@count = User.count(:conditions => ["username = ?", $current_username])
  	@user
  	if (@count <= 0)
	    @user = User.new
		@user.username = $current_username;
		@user.role = Role.find(:first, :conditions => ["name = ?", "Student"])
		@user.save
	else
		@user = User.find(:first, :conditions => ["username = ?", $current_username])
		#if user is admin, take them to export page
		if @user.role == Role.find(:first, :conditions => ["name = ?", "Administrator"])
		    @rsvps = Rsvp.find_by_sql "select * from rsvps limit 0,50"
			render :controller => 'rsvps', :action => 'index'
			return
		end

		#if user has already RSVP'd, take them to confirmation page
		@existing_rsvp = Rsvp.find(:first, :conditions => ["user_id = ?", @user.id])

SELECT * FROM `sections` WHERE (`sections`.`id` = 144452092)
SELECT * FROM `events` WHERE (`events`.`id` = 3882850)
INSERT INTO `rsvps` (`shirt_size`, `user_id`, `section_id`, `event_id`, `created_at`, `updated_at`) VALUES('M', NULL, 17025544, 3882850, '2010-08-30 19:29:39', '2010-08-30 19:29:39')
---
  def create
  	#check that count(rsvps with same evid, sectionid) < section.max_seats
    @rsvp = Rsvp.new(params[:rsvp])

	@section = Section.find(@rsvp.section_id)
	@event = Event.find(@rsvp.event_id)
	@section_rsvps = Rsvp.count_by_sql ['select count(*) from rsvps where section_id = ? and event_id = ? ', @section.id, @event.id]
	@sect = Section.find(@rsvp.section.id)
	@max_seats = @sect.max_seats

	if(@section_rsvps < @max_seats)
	    respond_to do |format|
	      if @rsvp.save